In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('ex1.csv')
print df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df = pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])
print df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
df = pd.read_csv('ex3.csv', index_col=['key1', 'key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
df = pd.read_csv('ex3.csv', index_col=['key1'])
df

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [19]:
df = pd.read_csv('ex4.txt')
df

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [20]:
df = pd.read_table('ex4.csv')
df

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [23]:
df = pd.read_table('ex4.txt', sep='\s+')
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [34]:
df = pd.read_csv('ex/ex5.csv', skiprows=[0, 2, 3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
sentinels = {'message': ['fop', 'NA'], 'something' : ['two']}
df = pd.read_csv('ex6.csv', na_values=sentinels)
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
df = pd.read_csv('ex7.csv', nrows=5)
df

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [30]:
df.to_csv('ex/ex7-1.csv')

In [35]:
import sys
df.to_csv(sys.stdout, sep='|')

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo

In [36]:
df.to_csv(sys.stdout)

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [37]:
df.to_csv(sys.stdout, na_rep='NULL')

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [38]:
df.to_csv(sys.stdout, index=False, header=False)

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [40]:
titanic = pd.read_csv('http://dato.com/files/titanic.csv', index_col=0)
titanic.tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [42]:
import pandas_datareader.data as web

In [43]:
import datetime

In [44]:
start = datetime.datetime(2015, 1, 1)
end = datetime.datetime(2016, 6, 30)

In [45]:
df = web.DataReader("005930.KS", 'yahoo', start, end)
df.tail()

                 Open       High        Low      Close  Volume   Adj Close
Date
2016-06-24  1445000.0  1445000.0  1360000.0  1400000.0  411000  1398999.31
2016-06-27  1400000.0  1405000.0  1385000.0  1398000.0  236700  1397000.74
2016-06-28  1390000.0  1404000.0  1379000.0  1399000.0  214300  1398000.02
2016-06-29  1408000.0  1412000.0  1391000.0  1396000.0  210500  1396000.00
2016-06-30  1408000.0  1445000.0  1397000.0  1425000.0  273400  1425000.00

In [47]:
df = web.DataReader("KRX:005930", 'google', start, end)
df.tail()

                 Open       High        Low      Close  Volume
Date
2016-06-24  1445000.0  1445000.0  1360000.0  1400000.0  408920
2016-06-27  1400000.0  1405000.0  1385000.0  1398000.0  236573
2016-06-28  1390000.0  1404000.0  1379000.0  1399000.0  213829
2016-06-29  1408000.0  1412000.0  1391000.0  1396000.0  208090
2016-06-30  1408000.0  1445000.0  1397000.0  1425000.0  272883

In [48]:
df = web.DataReader("GDP", 'fred', start, end)
df.tail()

                GDP
DATE
2015-04-01  17998.3
2015-07-01  18141.9
2015-10-01  18222.8
2016-01-01  18281.6
2016-04-01  18450.1

In [49]:
inflation = web.DataReader(['CPIAUCSL', 'CPILFESL'], 'fred', start, end)
inflation

            CPIAUCSL  CPILFESL
DATE
2015-01-01   234.954   239.915
2015-02-01   235.415   240.304
2015-03-01   235.859   240.797
2015-04-01   236.197   241.392
2015-05-01   236.876   241.672
2015-06-01   237.423   242.089
2015-07-01   237.734   242.464
2015-08-01   237.703   242.753
2015-09-01   237.489   243.224
2015-10-01   237.949   243.701
2015-11-01   238.302   244.139
2015-12-01   238.041   244.516
2016-01-01   238.107   245.232
2016-02-01   237.707   245.925
2016-03-01   237.920   246.095
2016-04-01   238.890   246.574
2016-05-01   239.403   247.064
2016-06-01   239.907   247.468